TEST2/meshConvergenceStudy/cases/fine/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Keep the focusBox cellSet for diagnostics only; blockMesh already resolves
// the donor film according to the ~70 nm Ti layers reported for femtosecond
// LIFT tests by Piqué et al. (Appl. Phys. A 1999), so refineMesh must not
// touch the mesh or it will recreate the concave sliver cells that
// checkMesh flagged in the user's log.
set                 focusBox;
coordinateSystem    global;
globalCoeffs
{
    tan1   (1 0 0);   // x-direction
    tan2   (0 0 1);   // z-direction
    normal (0 1 0);   // y-direction (film thickness)
}

// BlockMesh now resolves the Ti film thickness directly, so keep refineMesh as
// a true pass-through.  Leaving the directions list empty prevents any of the
// focusBox cells from being subdivided even if refineMesh is called out of
// habit after blockMesh.
directions           ();

useHexTopology      yes;
geometricCut        no;              // ensure no geometric splitting occurs
writeMesh           no;

nBufferLayers        0;
maxGlobalCells       30000000;
maxLocalCells        30000000;
minRefinementCells   0;

refinementRegions
{}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
